package com.hwaipy.rrdps;

import com.hwaipy.unifieddeviceinterface.DeviceException;
import com.hwaipy.unifieddeviceinterface.timeeventdevice.TimeEvent;
import com.hwaipy.unifieddeviceinterface.timeeventdevice.data.TimeEventDataManager;
import com.hwaipy.unifieddeviceinterface.timeeventdevice.data.TimeEventLoader;
import com.hwaipy.unifieddeviceinterface.timeeventdevice.pxi40ps1data.PXI40PS1Loader;
import com.hwaipy.unifieddeviceinterface.timeeventdevice.timeeventcontainer.StreamTimeEventList;
import com.hwaipy.unifieddeviceinterface.timeeventdevice.timeeventcontainer.TimeEventList;
import com.hwaipy.unifieddeviceinterface.timeeventdevice.timeeventcontainer.TimeEventSegment;
import java.io.BufferedInputStream;
import java.io.BufferedReader;
import java.io.File;
import java.io.FileInputStream;
import java.io.FileNotFoundException;
import java.io.IOException;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashMap;
import java.util.Iterator;
import java.util.Map;

/**
 *
 * @author Hwaipy
 */
public class Experiment {

    private static final boolean DEBUG = false;
    private static final int CHANNEL_APD1 = 2;
    private static final int CHANNEL_APD2 = 3;
    private static final Map<String, String[]> FILENAME_MAP = new HashMap<>();

    static {
//        //发射端时间测量数据，发射端随机数数据，接收端时间测量数据，接收端随机数数据，(接收端稳相数据)
        //20150131
//        FILENAME_MAP.put("20150130125829", new String[]{"20150130125829-S-固定-2_时间测量数据.dat", "20150130125829-S-固定-2_发射端随机数.dat", "20150130125829-R-固定-单路-APD2-2_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150130125949", new String[]{"20150130125949-S-固定-3_时间测量数据.dat", "20150130125949-S-固定-3_发射端随机数.dat", "20150130125949-R-固定-单路-APD1-3_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150130130214", new String[]{"20150130130214-S-随机-4_时间测量数据.dat", "20150130130214-S-随机-4_发射端随机数.dat", "20150130130214-R-随机-单路-APD1-4_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150130130316", new String[]{"20150130130316-S-随机-5_时间测量数据.dat", "20150130130316-S-随机-5_发射端随机数.dat", "20150130130316-R-随机-单路-APD2-5_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150123003253", new String[]{"20150123003253-S-随机-3_时间测量数据.dat", "20150123003253-S-随机-3_发射端随机数.dat", "20150123003253-R-随机-APD1-3_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150130134530", new String[]{"20150130134530-S-固定-PC12-3_时间测量数据.dat", "20150130134530-S-固定-PC12-3_发射端随机数.dat", "20150130134530-R-固定-PC12-APD1-3_时间测量数据.dat", "20150130134530-R-固定-PC12-APD1-3_接收端随机数.dat"});
//        FILENAME_MAP.put("20150130134722", new String[]{"20150130134722-S-随机-PC12-4_时间测量数据.dat", "20150130134722-S-随机-PC12-4_发射端随机数.dat", "20150130134722-R-随机-PC12-APD1-4_时间测量数据.dat", "20150130134722-R-随机-PC12-APD1-4_接收端随机数.dat"});
//        FILENAME_MAP.put("20150128185754", new String[]{"20150128185754-S-固定-7_时间测量数据.dat","20150128185754-S-固定-7_发射端随机数.dat","20150128185754-R-固定-PC-APD1-7_时间测量数据.dat","20150128185754-R-固定-PC-APD1-7_接收端随机数.dat"});
//        FILENAME_MAP.put("20150128185603", new String[]{"20150128185603-S-固定-6_时间测量数据.dat", "20150128185603-S-固定-6_发射端随机数.dat", "20150128185603-R-固定-PC1-APD2-6_时间测量数据.dat", "20150128185603-R-固定-PC1-APD2-6_接收端随机数.dat"});
//        FILENAME_MAP.put("20150128190139", new String[]{"20150128190139-S-固定-8_时间测量数据.dat", "20150128190139-S-固定-8_发射端随机数.dat", "20150128190139-R-固定-PC12-APD2-8_时间测量数据.dat", "20150128190139-R-固定-PC12-APD2-8_接收端随机数.dat"});
//        FILENAME_MAP.put("20150128190431", new String[]{"20150128190431-S-固定-9_时间测量数据.dat", "20150128190431-S-固定-9_发射端随机数.dat", "20150128190431-R-固定-PC12-APD1-9_时间测量数据.dat", "20150128190431-R-固定-PC12-APD1-9_接收端随机数.dat"});
//        FILENAME_MAP.put("20150127174646", new String[]{"20150127174646-S-固定-10_时间测量数据.dat","20150127174646-S-固定-10_发射端随机数.dat","20150127174647-R-PC16-APD2-10_时间测量数据.dat","20150127174647-R-PC16-APD2-10_接收端随机数.dat"});
//        FILENAME_MAP.put("20150127174833", new String[]{"20150127174833-S-固定-11_时间测量数据.dat","20150127174833-S-固定-11_发射端随机数.dat","20150127174833-R-PC16-APD1-11_时间测量数据.dat","20150127174833-R-PC16-APD1-11_接收端随机数.dat"});

//        //20150206第二次
//        FILENAME_MAP.put("20150206235224", new String[]{"20150206235224-s-固定随机数单路1_时间测量数据.dat", "20150206235224-s-固定随机数单路1_发射端随机数.dat", "20150206235224-R-固定-APD1-1_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150206235449", new String[]{"20150206235449-s-固定随机数单路2_时间测量数据.dat", "20150206235449-s-固定随机数单路2_发射端随机数.dat", "20150206235449-R-固定-APD2-2_时间测量数据.dat", "rnd-00.dat"});
//
//        //2015-2-7第一次
//        FILENAME_MAP.put("20150207162939", new String[]{"20150207162939-s-固定随机数单路1_时间测量数据.dat", "20150207162939-s-固定随机数单路1_发射端随机数.dat", "20150207162939-R-固定-APD2-1_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150207163135", new String[]{"20150207163135-s-固定随机数单路2_时间测量数据.dat", "20150207163135-s-固定随机数单路2_发射端随机数.dat", "20150207163135-R-固定-APD1-2_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150207163609", new String[]{"20150207163609-s-真随机数单路4_时间测量数据.dat", "20150207163609-s-真随机数单路4_发射端随机数.dat", "20150207163609-R-随机-APD2-4_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150207163313", new String[]{"20150207163313-s-真随机数单路3_时间测量数据.dat", "20150207163313-s-真随机数单路3_发射端随机数.dat", "20150207163313-R-随机-APD1-3_时间测量数据.dat", "rnd-00.dat"});
//        FILENAME_MAP.put("20150207164011", new String[]{"20150207164011-s-固定随机数2路5_时间测量数据.dat", "20150207164011-s-固定随机数2路5_发射端随机数.dat", "20150207164012-R-固定-PC2-APD2-5_时间测量数据.dat", "20150207164012-R-固定-PC2-APD2-5_接收端随机数.dat"});
//        FILENAME_MAP.put("20150207164339", new String[]{"20150207164339-s固定随机数2路6_时间测量数据.dat", "20150207164339-s固定随机数2路6_发射端随机数.dat", "20150207164340-R-固定-PC2-APD1-6_时间测量数据.dat", "20150207164340-R-固定-PC2-APD1-6_接收端随机数.dat"});
//        FILENAME_MAP.put("20150207171149", new String[]{"20150207171149-s-固定随机数7路14_时间测量数据.dat", "20150207171149-s-固定随机数7路14_发射端随机数.dat", "20150207171149-R-固定-PC-APD1-14_时间测量数据.dat", "20150207171149-R-固定-PC-APD1-14_接收端随机数.dat"});
//        FILENAME_MAP.put("20150207171035", new String[]{"20150207171035-s-固定随机数7路13_时间测量数据.dat", "20150207171035-s-固定随机数7路13_发射端随机数.dat", "20150207171036-R-固定-PC-APD2-13_时间测量数据.dat", "20150207171036-R-固定-PC-APD2-13_接收端随机数.dat"});
        //2015-2-8//稳相测试
//        FILENAME_MAP.put("20150212024655", new String[]{"20150212024655_时间测量数据.dat", "20150212024655_发射端随机数.dat", "20150212024655-PC-APD1-6_时间测量数据.dat", "20150212024655-PC-APD1-6_接收端随机数.dat", "20150212024655-PC-APD1-6_稳相结果.csv", "20150212024655-PC-APD1-6_稳相数据.csv"});
//
//        //2015-2-12
//        FILENAME_MAP.put("20150212224328", new String[]{"20150212224328-S-2_时间测量数据.dat", "20150212224328-S-2_发射端随机数.dat", "20150212224328-单路-固定-APD1-2_时间测量数据.dat", "rnd-00.dat", "20150212224328-单路-固定-APD1-2_稳相结果.csv", "20150212224328-单路-固定-APD1-2_稳相数据.csv"});
//        FILENAME_MAP.put("20150212235016", new String[]{"20150212235016-s-3_时间测量数据.dat", "20150212235016-s-3_发射端随机数.dat", "20150212235016-PC35-固定-APD1-3_时间测量数据.dat", "20150212235016-PC35-固定-APD1-3_接收端随机数.dat", "20150212235016-PC35-固定-APD1-3_稳相结果.csv", "20150212235016-PC35-固定-APD1-3_稳相数据.csv"});
//        FILENAME_MAP.put("20150213003554", new String[]{"20150213003554-s-5_时间测量数据.dat", "20150213003554-s-5_发射端随机数.dat", "20150213003554-PC345-固定-APD1-5_时间测量数据.dat", "20150213003554-PC345-固定-APD1-5_接收端随机数.dat", "20150213003554-PC345-固定-APD1-5_稳相结果.csv", "20150213003554-PC345-固定-APD1-5_稳相数据.csv"});
//        FILENAME_MAP.put("20150213004935", new String[]{"20150213004935-s-6_时间测量数据.dat", "20150213004935-s-6_发射端随机数.dat", "20150213004935-PC13456-随机-APD1-6_时间测量数据.dat", "20150213004935-PC13456-随机-APD1-6_接收端随机数.dat", "20150213004935-PC13456-随机-APD1-6_稳相结果.csv", "20150213004935-PC13456-随机-APD1-6_稳相数据.csv"});
//        FILENAME_MAP.put("20150213011049", new String[]{"20150213011049-s-7_时间测量数据.dat", "20150213011049-s-7_发射端随机数.dat", "20150213011049-PC13456-随机-APD1-7_时间测量数据.dat", "20150213011049-PC13456-随机-APD1-7_接收端随机数.dat", "20150213011049-PC13456-随机-APD1-7_稳相结果.csv", "20150213011049-PC13456-随机-APD1-7_稳相数据.csv"});
//        FILENAME_MAP.put("20150213011520", new String[]{"20150213011520-s-8_时间测量数据.dat", "20150213011520-s-8_发射端随机数.dat", "20150213011520-PC345-随机-APD1-8_时间测量数据.dat", "20150213011520-PC345-随机-APD1-8_接收端随机数.dat", "20150213011520-PC345-随机-APD1-8_稳相结果.csv", "20150213011520-PC345-随机-APD1-8_稳相数据.csv"});
//
//        //2015-2-14正式采数
//        FILENAME_MAP.put("20150214100455", new String[]{"20150214100455-s-pc7-3_时间测量数据.dat", "20150214100455-s-pc7-3_发射端随机数.dat", "20150214100455-PCALL-APD2-3_时间测量数据.dat", "20150214100455-PCALL-APD2-3_接收端随机数.dat", "20150214100455-PCALL-APD2-3_稳相结果.csv", "20150214100455-PCALL-APD2-3_稳相数据.csv"});
//        //2015-2-28
//        FILENAME_MAP.put("20150228232128", new String[]{"20150228232128-s-3_时间测量数据.dat", "20150228232128-s-3_发射端随机数.dat", "20150228232128-R-固定-new-APD2-3_时间测量数据.dat", "rnd-00.dat", "20150228232128-R-固定-new-APD2-3_稳相结果.csv", "20150228232128-R-固定-new-APD2-3_稳相数据.csv"});
        //2015-3-1
//        FILENAME_MAP.put("20150301221730", new String[]{"20150301221730-S-1_时间测量数据.dat", "20150301221730-S-1_发射端随机数.dat", "20150301221730-R-固定-old-APD2-1_时间测量数据.dat", "rnd-00.dat", "20150301221730-R-固定-old-APD2-1_稳相结果.csv", "20150301221730-R-固定-old-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150301222829", new String[]{"20150301222829-S-2_时间测量数据.dat", "20150301222829-S-2_发射端随机数.dat", "20150301222829-R-固定-old-APD2-2_时间测量数据.dat", "20150301222829-R-固定-old-APD2-2_接收端随机数.dat", "20150301222829-R-固定-old-APD2-2_稳相结果.csv", "20150301222829-R-固定-old-APD2-2_稳相数据.csv"});
        //2015-3-4
//        FILENAME_MAP.put("20150304170440", new String[]{"20150304170440-S-3_时间测量数据.dat", "20150304170440-S-3_发射端随机数.dat", "20150304170440-R-固定-APD2-3_时间测量数据.dat", "rnd-00.dat", "20150304170440-R-固定-APD2-3_稳相结果.csv", "20150304170440-R-固定-APD2-3_稳相数据.csv"});
//        FILENAME_MAP.put("20150304172957", new String[]{"20150304172957-S-5_时间测量数据.dat", "20150304172957-S-5_发射端随机数.dat", "20150304172958-R-分时稳相-PC136-5_时间测量数据.dat", "20150304172958-R-分时稳相-PC136-5_接收端随机数.dat", "20150304172958-R-分时稳相-PC136-5_稳相结果.csv", "20150304172958-R-分时稳相-PC136-5_稳相数据.csv"});
        //2015-3-5
//        FILENAME_MAP.put("20150305134028", new String[]{"20150305134028-S-2_时间测量数据.dat", "20150305134028-S-2_发射端随机数.dat", "20150305134028-R-分时稳相-单路-固定-APD2-2_时间测量数据.dat", "20150305134028-R-分时稳相-单路-固定-APD2-2_接收端随机数.dat", "20150305134028-R-分时稳相-单路-固定-APD2-2_稳相结果.csv", "20150305134028-R-分时稳相-单路-固定-APD2-2_稳相数据.csv"});
//        FILENAME_MAP.put("20150305135813", new String[]{"20150305135813-S-3_时间测量数据.dat", "20150305135813-S-3_发射端随机数.dat", "20150305135813-R-分时稳相-单路-PC1-APD2-3_时间测量数据.dat", "20150305135813-R-分时稳相-单路-PC1-APD2-3_接收端随机数.dat", "20150305135813-R-分时稳相-单路-PC1-APD2-3_稳相结果.csv", "20150305135813-R-分时稳相-单路-PC1-APD2-3_稳相数据.csv"});
//        FILENAME_MAP.put("20150305140222", new String[]{"20150305140222-S-4_时间测量数据.dat", "20150305140222-S-4_发射端随机数.dat", "20150305140222-R-分时稳相-单路-PC16-APD2-4_时间测量数据.dat", "20150305140222-R-分时稳相-单路-PC16-APD2-4_接收端随机数.dat", "20150305140222-R-分时稳相-单路-PC16-APD2-4_稳相结果.csv", "20150305140222-R-分时稳相-单路-PC16-APD2-4_稳相数据.csv"});
//        FILENAME_MAP.put("20150305141233", new String[]{"20150305141233-S-6_时间测量数据.dat", "20150305141233-S-6_发射端随机数.dat", "20150305141233-R-分时稳相-PC1-随机-APD2-6_时间测量数据.dat", "20150305141233-R-分时稳相-PC1-随机-APD2-6_接收端随机数.dat", "20150305141233-R-分时稳相-PC1-随机-APD2-6_稳相结果.csv", "20150305141233-R-分时稳相-PC1-随机-APD2-6_稳相数据.csv"});
//        FILENAME_MAP.put("20150305140818", new String[]{"20150305140818-S-5_时间测量数据.dat", "20150305140818-S-5_发射端随机数.dat", "20150305140818-R-分时稳相-单路-PC136-APD2-5_时间测量数据.dat", "20150305140818-R-分时稳相-单路-PC136-APD2-5_接收端随机数.dat", "20150305140818-R-分时稳相-单路-PC136-APD2-5_稳相结果.csv", "20150305140818-R-分时稳相-单路-PC136-APD2-5_稳相数据.csv"});
//        FILENAME_MAP.put("20150305214301", new String[]{"20150305214301-S-1_时间测量数据.dat", "20150305214301-S-1_发射端随机数.dat", "20150305214301-R-随机-单路-APD2-1_时间测量数据.dat", "20150305214301-R-随机-单路-APD2-1_接收端随机数.dat", "20150305214301-R-随机-单路-APD2-1_稳相结果.csv", "20150305214301-R-随机-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150305220600", new String[]{"20150305220600-S-2_时间测量数据.dat", "20150305220600-S-2_发射端随机数.dat", "20150305220600-R-随机-PC13-APD2-2_时间测量数据.dat", "20150305220600-R-随机-PC13-APD2-2_接收端随机数.dat", "20150305220600-R-随机-PC13-APD2-2_稳相结果.csv", "20150305220600-R-随机-PC13-APD2-2_稳相数据.csv"});
//        FILENAME_MAP.put("20150305221736", new String[]{"20150305221736-S-5_时间测量数据.dat", "20150305221736-S-5_发射端随机数.dat", "20150305221736-R-随机-PC13456-APD2-5_时间测量数据.dat", "20150305221736-R-随机-PC13456-APD2-5_接收端随机数.dat", "20150305221736-R-随机-PC13456-APD2-5_稳相结果.csv", "20150305221736-R-随机-PC13456-APD2-5_稳相数据.csv"});
        //2015-3-8
//        FILENAME_MAP.put("20150308155159", new String[]{"20150308155159-S-1_时间测量数据.dat", "20150308155159-S-1_发射端随机数.dat", "20150308155159-R-固定-单路-APD2-1_时间测量数据.dat", "20150308155159-R-固定-单路-APD2-1_接收端随机数.dat", "20150308155159-R-固定-单路-APD2-1_稳相结果.csv", "20150308155159-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150308160846", new String[]{"20150308160846-S-2_时间测量数据.dat", "20150308160846-S-2_发射端随机数.dat", "20150308160846-R-随机-PC13467-APD2-2_时间测量数据.dat", "20150308160846-R-随机-PC13467-APD2-2_接收端随机数.dat", "20150308160846-R-随机-PC13467-APD2-2_稳相结果.csv", "20150308160846-R-随机-PC13467-APD2-2_稳相数据.csv"});
//        FILENAME_MAP.put("20150308161059", new String[]{"20150308161059-S-3_时间测量数据.dat", "20150308161059-S-3_发射端随机数.dat", "20150308161059-R-随机-PC13467-APD2-3_时间测量数据.dat", "20150308161059-R-随机-PC13467-APD2-3_接收端随机数.dat", "20150308161059-R-随机-PC13467-APD2-3_稳相结果.csv", "20150308161059-R-随机-PC13467-APD2-3_稳相数据.csv"});
//        FILENAME_MAP.put("20150308161653", new String[]{"20150308161653-S-4_时间测量数据.dat", "20150308161653-S-4_发射端随机数.dat", "20150308161653-R-随机-PCALL-APD2-4_时间测量数据.dat", "20150308161653-R-随机-PCALL-APD2-4_接收端随机数.dat", "20150308161653-R-随机-PCALL-APD2-4_稳相结果.csv", "20150308161653-R-随机-PCALL-APD2-4_稳相数据.csv"});
//        FILENAME_MAP.put("20150308170959", new String[]{"20150308170959-S-7_时间测量数据.dat", "20150308170959-S-7_发射端随机数.dat", "20150308170959-R-随机-PC7-APD1-7_时间测量数据.dat", "20150308170959-R-随机-PC7-APD1-7_接收端随机数.dat", "20150308170959-R-随机-PC7-APD1-7_稳相结果.csv", "20150308170959-R-随机-PC7-APD1-7_稳相数据.csv"});
//        FILENAME_MAP.put("20150308170804", new String[]{"20150308170804-S-6_时间测量数据.dat", "20150308170804-S-6_发射端随机数.dat", "20150308170803-R-随机-PC7-APD2-6_时间测量数据.dat", "20150308170803-R-随机-PC7-APD2-6_接收端随机数.dat", "20150308170803-R-随机-PC7-APD2-6_稳相结果.csv", "20150308170803-R-随机-PC7-APD2-6_稳相数据.csv"});
//        FILENAME_MAP.put("20150308173038", new String[]{"20150308173038-S-9_时间测量数据.dat", "20150308173038-S-9_发射端随机数.dat", "20150308173038-R-固定-PC7-APD1-9_时间测量数据.dat", "20150308173038-R-固定-PC7-APD1-9_接收端随机数.dat", "20150308173038-R-固定-PC7-APD1-9_稳相结果.csv", "20150308173038-R-固定-PC7-APD1-9_稳相数据.csv"});
//        FILENAME_MAP.put("20150308161907", new String[]{"20150308161907-S-5_时间测量数据.dat", "20150308161907-S-5_发射端随机数.dat", "20150308161907-R-随机-PCALL-APD2-5_时间测量数据.dat", "20150308161907-R-随机-PCALL-APD2-5_接收端随机数.dat", "20150308161907-R-随机-PCALL-APD2-5_稳相结果.csv", "20150308161907-R-随机-PCALL-APD2-5_稳相数据.csv"});
//        FILENAME_MAP.put("20150308231004", new String[]{"20150308231004-S-10_时间测量数据.dat", "20150308231004-S-10_发射端随机数.dat", "20150308231004-R-固定-单路-交换APD2-10_时间测量数据.dat", "20150308231004-R-固定-单路-交换APD2-10_接收端随机数.dat", "20150308231004-R-固定-单路-交换APD2-10_稳相结果.csv", "20150308231004-R-固定-单路-交换APD2-10_稳相数据.csv"});
//        FILENAME_MAP.put("20150308231955", new String[]{"20150308231955-S-11_时间测量数据.dat", "20150308231955-S-11_发射端随机数.dat", "20150308231955-R-固定-单路-交换APD2-11_时间测量数据.dat", "20150308231955-R-固定-单路-交换APD2-11_接收端随机数.dat", "20150308231955-R-固定-单路-交换APD2-11_稳相结果.csv", "20150308231955-R-固定-单路-交换APD2-11_稳相数据.csv"});
//        FILENAME_MAP.put("20150308233607", new String[]{"20150308233607-S-12_时间测量数据.dat", "20150308233607-S-12_发射端随机数.dat", "20150308233607-R-固定-单路-更换APD2-12_时间测量数据.dat", "20150308233607-R-固定-单路-更换APD2-12_接收端随机数.dat", "20150308233607-R-固定-单路-更换APD2-12_稳相结果.csv", "20150308233607-R-固定-单路-更换APD2-12_稳相数据.csv"});
//        FILENAME_MAP.put("20150308235031", new String[]{"20150308235031-S-13_时间测量数据.dat", "20150308235031-S-13_发射端随机数.dat", "20150308235031-R-固定-单路-更换APD2-13_时间测量数据.dat", "20150308235031-R-固定-单路-更换APD2-13_接收端随机数.dat", "20150308233607-R-固定-单路-更换APD2-12_稳相结果.csv", "20150308233607-R-固定-单路-更换APD2-12_稳相数据.csv"});
//        FILENAME_MAP.put("20150309000539", new String[]{"20150309000539-S-14_时间测量数据.dat", "20150309000539-S-14_发射端随机数.dat", "20150309000539-R-固定-单路-更换APD2-14_时间测量数据.dat", "20150309000539-R-固定-单路-更换APD2-14_接收端随机数.dat", "20150308233607-R-固定-单路-更换APD2-12_稳相结果.csv", "20150308233607-R-固定-单路-更换APD2-12_稳相数据.csv"});
//        FILENAME_MAP.put("20150309001648", new String[]{"20150309001648-S-15_时间测量数据.dat", "20150309001648-S-15_发射端随机数.dat", "20150309001648-R-固定-单路-更换APD2-15_时间测量数据.dat", "20150309001648-R-固定-单路-更换APD2-15_接收端随机数.dat", "20150308233607-R-固定-单路-更换APD2-12_稳相结果.csv", "20150308233607-R-固定-单路-更换APD2-12_稳相数据.csv"});
//        //2015-3-9
//        FILENAME_MAP.put("20150309213044", new String[]{"20150309213044-S-1_时间测量数据.dat", "20150309213044-S-1_发射端随机数.dat", "20150309213044-R-固定-单路-APD2-1_时间测量数据.dat", "20150309213044-R-固定-单路-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150309221108", new String[]{"20150309221108-S-2_时间测量数据.dat", "20150309221108-S-2_发射端随机数.dat", "20150309221108-R-固定-单路-APD2-2_时间测量数据.dat", "20150309221108-R-固定-单路-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//          FILENAME_MAP.put("20150309225804", new String[]{"20150309225804-S-3_时间测量数据.dat", "20150309225804-S-3_发射端随机数.dat", "20150309225804-R-固定-单路-APD2-3_时间测量数据.dat", "20150309225804-R-固定-单路-APD2-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//         FILENAME_MAP.put("20150309231224", new String[]{"20150309231224-S-4_时间测量数据.dat", "20150309231224-S-4_发射端随机数.dat", "20150309231224-R-固定-单路-APD1-4_时间测量数据.dat", "20150309231224-R-固定-单路-APD1-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//         FILENAME_MAP.put("20150309232505", new String[]{"20150309232505-S-5_时间测量数据.dat", "20150309232505-S-5_发射端随机数.dat", "20150309232505-R-固定-单路-APD1-5_时间测量数据.dat", "20150309232505-R-固定-单路-APD1-5_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150309234200", new String[]{"20150309234200-S-6_时间测量数据.dat", "20150309234200-S-6_发射端随机数.dat", "20150309234200-R-固定-单路-APD2-6_时间测量数据.dat", "20150309234200-R-固定-单路-APD2-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310001456", new String[]{"20150310001456-S-9_时间测量数据.dat", "20150310001456-S-9_发射端随机数.dat", "20150310001456-R-固定-单路-APD2-9_时间测量数据.dat", "20150310001456-R-固定-单路-APD2-9_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310003316", new String[]{"20150310003316-S-10_时间测量数据.dat", "20150310003316-S-10_发射端随机数.dat", "20150310003316-R-固定-单路-APD2-10_时间测量数据.dat", "20150310003316-R-固定-单路-APD2-10_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//          FILENAME_MAP.put("20150310004441", new String[]{"20150310004441-S-11_时间测量数据.dat", "20150310004441-S-11_发射端随机数.dat", "20150310004441-R-固定-单路-APD2-11_时间测量数据.dat", "20150310004441-R-固定-单路-APD2-11_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//         FILENAME_MAP.put("20150310005347", new String[]{"20150310005347-S-12_时间测量数据.dat", "20150310005347-S-12_发射端随机数.dat", "20150310005347-R-固定-单路-APD2-12_时间测量数据.dat", "20150310005347-R-固定-单路-APD2-12_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310005509", new String[]{"20150310005509-S-13_时间测量数据.dat", "20150310005509-S-13_发射端随机数.dat", "20150310005509-R-固定-单路-APD1-13_时间测量数据.dat", "20150310005509-R-固定-单路-APD1-13_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//       
//        //2015-3-10
//        FILENAME_MAP.put("20150310164321", new String[]{"20150310164321-S-1_时间测量数据.dat", "20150310164321-S-1_发射端随机数.dat", "20150310164321-R-随机-单路-APD2-1_时间测量数据.dat", "20150310164321-R-随机-单路-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//         FILENAME_MAP.put("20150310165657", new String[]{"20150310165657-S-2_时间测量数据.dat", "20150310165657-S-2_发射端随机数.dat", "20150310165656-R-随机-单路-APD2-2_时间测量数据.dat", "20150310165656-R-随机-单路-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310171506", new String[]{"20150310171506-S-3_时间测量数据.dat", "20150310171506-S-3_发射端随机数.dat", "20150310171506-R-随机-单路-APD2-3_时间测量数据.dat", "20150310171506-R-随机-单路-APD2-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310173034", new String[]{"20150310173034-S-4_时间测量数据.dat", "20150310173034-S-4_发射端随机数.dat", "20150310173034-R-单路-互换APD1-4_时间测量数据.dat", "20150310173034-R-单路-互换APD1-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310174254", new String[]{"20150310174254-S-5_时间测量数据.dat", "20150310174254-S-5_发射端随机数.dat", "20150310174254-R-随机-单路-APD2-5_时间测量数据.dat", "20150310174254-R-随机-单路-APD2-5_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310180244", new String[]{"20150310180244-S-6_时间测量数据.dat", "20150310180244-S-6_发射端随机数.dat", "20150310180244-R-PCALL-APD2-6_时间测量数据.dat", "20150310180244-R-PCALL-APD2-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//         FILENAME_MAP.put("20150310180816", new String[]{"20150310180816-S-9_时间测量数据.dat", "20150310180816-S-9_发射端随机数.dat", "20150310180816-R-PCALL-APD1-9_时间测量数据.dat", "20150310180816-R-PCALL-APD1-9_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310204927", new String[]{"20150310204927-S-10_时间测量数据.dat", "20150310204927-S-10_发射端随机数.dat", "20150310204927-R-单路-APD2-10_时间测量数据.dat", "20150310204927-R-单路-APD2-10_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310205857", new String[]{"20150310205857-S-11_时间测量数据.dat", "20150310205857-S-11_发射端随机数.dat", "20150310205857-R-单路-APD2-11_时间测量数据.dat", "20150310205857-R-单路-APD2-11_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310211321", new String[]{"20150310211321-S-12_时间测量数据.dat", "20150310211321-S-12_发射端随机数.dat", "20150310211321-R-APD1-12_时间测量数据.dat", "20150310211321-R-APD1-12_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310213008", new String[]{"20150310213008-S-13_时间测量数据.dat", "20150310213008-S-13_发射端随机数.dat", "20150310213008-R-APD1-13_时间测量数据.dat", "20150310213008-R-APD1-13_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//         FILENAME_MAP.put("20150310222723", new String[]{"20150310222723-S-14_时间测量数据.dat", "20150310222723-S-14_发射端随机数.dat", "20150310222723-R-APD2-14_时间测量数据.dat", "20150310222723-R-APD2-14_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//         FILENAME_MAP.put("20150310224451", new String[]{"20150310224451-S-15_时间测量数据.dat", "20150310224451-S-15_发射端随机数.dat", "20150310224451-R-APD2-15_时间测量数据.dat", "20150310224451-R-APD2-15_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310225828", new String[]{"20150310225828-S-16_时间测量数据.dat", "20150310225828-S-16_发射端随机数.dat", "20150310225828-R-APD1-16_时间测量数据.dat", "20150310225828-R-APD1-16_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310234030", new String[]{"20150310234030-S-17_时间测量数据.dat", "20150310234030-S-17_发射端随机数.dat", "20150310234030-R-固定-PCALL-APD2-17_时间测量数据.dat", "20150310234030-R-固定-PCALL-APD2-17_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150310234317", new String[]{"20150310234317-S-19_时间测量数据.dat", "20150310234317-S-19_发射端随机数.dat", "20150310234317-R-随机-PCALL-APD2-19_时间测量数据.dat", "20150310234317-R-随机-PCALL-APD2-19_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//
//        //2015-3-11
//        FILENAME_MAP.put("20150311220520", new String[]{"20150311220520-S-1_时间测量数据.dat", "20150311220520-S-1_发射端随机数.dat", "20150311220520-R-固定-单路-APD2-1_时间测量数据.dat", "20150311220520-R-固定-单路-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150311231700", new String[]{"20150311231700-S-2_时间测量数据.dat", "20150311231700-S-2_发射端随机数.dat", "20150311231700-R-固定-单路-APD2-2_时间测量数据.dat", "20150311231700-R-固定-单路-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150311233558", new String[]{"20150311233558-S-3_时间测量数据.dat", "20150311233558-S-3_发射端随机数.dat", "20150311233558-R-固定-单路-APD1-3_时间测量数据.dat", "20150311233558-R-固定-单路-APD1-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150311234437", new String[]{"20150311234437-S-4_时间测量数据.dat", "20150311234437-S-4_发射端随机数.dat", "20150311234437-R-固定-单路-APD2-4_时间测量数据.dat", "20150311234437-R-固定-单路-APD2-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150311235931", new String[]{"20150311235931-S-5_时间测量数据.dat", "20150311235931-S-5_发射端随机数.dat", "20150311235931-R-固定-单路-APD2-5_时间测量数据.dat", "20150311235931-R-固定-单路-APD2-5_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//
//        //2015-3-14
//        FILENAME_MAP.put("20150314155349", new String[]{"20150314155349-S-1_时间测量数据.dat", "20150314155349-S-1_发射端随机数.dat", "20150314155349-R-固定-单路-APD2-1_时间测量数据.dat", "20150314155349-R-固定-单路-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314162346", new String[]{"20150314162346-S-2_时间测量数据.dat", "20150314162346-S-2_发射端随机数.dat", "20150314162346-R-固定-单路-APD1-2_时间测量数据.dat", "20150314162346-R-固定-单路-APD1-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314165311", new String[]{"20150314165311-S-4_时间测量数据.dat", "20150314165311-S-4_发射端随机数.dat", "20150314165312-R-固定-PC7-APD1-4_时间测量数据.dat", "20150314165312-R-固定-PC7-APD1-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314171913", new String[]{"20150314171913-S-5_时间测量数据.dat", "20150314171913-S-5_发射端随机数.dat", "20150314171913-R-固定-单路-APD1-5_时间测量数据.dat", "20150314171913-R-固定-单路-APD1-5_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314222133", new String[]{"20150314222133-S-6_时间测量数据.dat", "20150314222133-S-6_发射端随机数.dat", "20150314222133-R-固定-单路-APD1-6_时间测量数据.dat", "20150314222133-R-固定-单路-APD1-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314224517", new String[]{"20150314224517-S-7_时间测量数据.dat", "20150314224517-S-7_发射端随机数.dat", "20150314224517-R-固定-单路-APD1-7_时间测量数据.dat", "20150314224517-R-固定-单路-APD1-7_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314230912", new String[]{"20150314230912-S-8_时间测量数据.dat", "20150314230912-S-8_发射端随机数.dat", "20150314230912-R-固定-单路-APD1-8_时间测量数据.dat", "20150314230912-R-固定-单路-APD1-8_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314232503", new String[]{"20150314232503-S-9_时间测量数据.dat", "20150314232503-S-9_发射端随机数.dat", "20150314232504-R-随机-PC7-APD1-9_时间测量数据.dat", "20150314232504-R-随机-PC7-APD1-9_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150314234504", new String[]{"20150314234504-S-10_时间测量数据.dat", "20150314234504-S-10_发射端随机数.dat", "20150314234504-R-随机-PC7-APD1-10_时间测量数据.dat", "20150314234504-R-随机-PC7-APD1-10_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315003342", new String[]{"20150315003342-S-13_时间测量数据.dat", "20150315003342-S-13_发射端随机数.dat", "20150315003342-R-随机-固定-APD2-13_时间测量数据.dat", "20150315003342-R-随机-固定-APD2-13_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315003746", new String[]{"20150315003746-S-14_时间测量数据.dat", "20150315003746-S-14_发射端随机数.dat", "20150315003746-R-随机-PC5-APD2-14_时间测量数据.dat", "20150315003746-R-随机-PC5-APD2-14_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//
//        //2015-3-15
//        FILENAME_MAP.put("20150315165450", new String[]{"20150315165450-S-1_时间测量数据.dat", "20150315165450-S-1_发射端随机数.dat", "20150315165450-R-随机-单路-APD2-1_时间测量数据.dat", "20150315165450-R-随机-单路-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315171010", new String[]{"20150315171010-S-2_时间测量数据.dat", "20150315171010-S-2_发射端随机数.dat", "20150315171010-R-随机-PC7-APD2-2_时间测量数据.dat", "20150315171010-R-随机-PC7-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315173117", new String[]{"20150315173117-S-3_时间测量数据.dat", "20150315173117-S-3_发射端随机数.dat", "20150315173117-R-随机-PC7-APD2-3_时间测量数据.dat", "20150315173117-R-随机-PC7-APD2-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315175601", new String[]{"20150315175601-S-4_时间测量数据.dat", "20150315175601-S-4_发射端随机数.dat", "20150315175601-R-随机-PC7-APD2-4_时间测量数据.dat", "20150315175601-R-随机-PC7-APD2-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315175601", new String[]{"20150315215514-S-5_时间测量数据.dat", "20150315215514-S-5_发射端随机数.dat", "20150315215514-R-随机-APD2-5_时间测量数据.dat", "20150315215514-R-随机-APD2-5_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315221104", new String[]{"20150315221104-S-7_时间测量数据.dat", "20150315221104-S-7_发射端随机数.dat", "20150315221104-R-随机-PC12357-APD2-7_时间测量数据.dat", "20150315221104-R-随机-PC12357-APD2-7_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315220801", new String[]{"20150315220801-S-6_时间测量数据.dat", "20150315220801-S-6_发射端随机数.dat", "20150315220801-R-随机-PC135-APD2-6_时间测量数据.dat", "20150315220801-R-随机-PC135-APD2-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315224122", new String[]{"20150315224122-S-9_时间测量数据.dat", "20150315224122-S-9_发射端随机数.dat", "20150315224122-R-随机-PCALL-APD2-9_时间测量数据.dat", "20150315224122-R-随机-PCALL-APD2-9_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315223857", new String[]{"20150315223857-S-8_时间测量数据.dat", "20150315223857-S-8_发射端随机数.dat", "20150315223857-R-随机-PCALL-APD2-8_时间测量数据.dat", "20150315223857-R-随机-PCALL-APD2-8_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315224355", new String[]{"20150315224355-S-10_时间测量数据.dat", "20150315224355-S-10_发射端随机数.dat", "20150315224355-R-随机-PCALL-APD2-10_时间测量数据.dat", "20150315224355-R-随机-PCALL-APD2-10_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315224557", new String[]{"20150315224557-S-11_时间测量数据.dat", "20150315224557-S-11_发射端随机数.dat", "20150315224557-R-随机-PCALL-APD2-11_时间测量数据.dat", "20150315224557-R-随机-PCALL-APD2-11_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315224911", new String[]{"20150315224911-S-12_时间测量数据.dat", "20150315224911-S-12_发射端随机数.dat", "20150315224911-R-随机-PCALL-APD2-12_时间测量数据.dat", "20150315224911-R-随机-PCALL-APD2-12_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315225126", new String[]{"20150315225126-S-13_时间测量数据.dat", "20150315225126-S-13_发射端随机数.dat", "20150315225126-R-随机-PCALL-APD2-13_时间测量数据.dat", "20150315225126-R-随机-PCALL-APD2-13_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315225251", new String[]{"20150315225251-S-14_时间测量数据.dat", "20150315225251-S-14_发射端随机数.dat", "20150315225251-R-随机-PCALL-APD2-14_时间测量数据.dat", "20150315225251-R-随机-PCALL-APD2-14_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//
//        FILENAME_MAP.put("20150315232613", new String[]{"20150315232613-S-15_时间测量数据.dat", "20150315232613-S-15_随机数.dat", "20150315232613-R-随机-PCALL-APD1-15_时间测量数据.dat", "20150315232613-R-随机-PCALL-APD1-15_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315232741", new String[]{"20150315232741-S-16_时间测量数据.dat", "20150315232741-S-16_随机数.dat", "20150315232741-R-随机-PCALL-APD1-16_时间测量数据.dat", "20150315232741-R-随机-PCALL-APD1-16_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315232938", new String[]{"20150315232938-S-17_时间测量数据.dat", "20150315232938-S-17_随机数.dat", "20150315232938-R-随机-PCALL-APD1-17_时间测量数据.dat", "20150315232938-R-随机-PCALL-APD1-17_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315233209", new String[]{"20150315233209-S-18_时间测量数据.dat", "20150315233209-S-18_随机数.dat", "20150315233208-R-随机-PCALL-APD1-18_时间测量数据.dat", "20150315233208-R-随机-PCALL-APD1-18_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315233326", new String[]{"20150315233326-S-19_时间测量数据.dat", "20150315233326-S-19_随机数.dat", "20150315233326-R-随机-PCALL-APD1-19_时间测量数据.dat", "20150315233326-R-随机-PCALL-APD1-19_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150315233515", new String[]{"20150315233515-S-20_时间测量数据.dat", "20150315233515-S-20_随机数.dat", "20150315233515-R-随机-PCALL-APD1-20_时间测量数据.dat", "20150315233515-R-随机-PCALL-APD1-20_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150316000534", new String[]{"20150316000534-S-21_时间测量数据.dat", "20150316000534-S-21_随机数.dat", "20150316000534-R-随机-APD1-21_时间测量数据.dat", "20150316000534-R-随机-APD1-21_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//
//        //2015-3-16
//        FILENAME_MAP.put("20150316204552", new String[]{"20150316204552-S-3_时间测量数据.dat", "20150316204552-S-3_随机数.dat", "20150316204552-R-随机-单路-APD1-3_时间测量数据.dat", "20150316204552-R-随机-单路-APD1-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150316211631", new String[]{"20150316211631-S-4_时间测量数据.dat", "20150316211631-S-4_随机数.dat", "20150316211631-R-随机-单路-APD2-4_时间测量数据.dat", "20150316211631-R-随机-单路-APD2-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150316214425", new String[]{"20150316214425-S-6_时间测量数据.dat", "20150316214425-S-6_随机数.dat", "20150316214425-R-随机-PCALL-APD2-6_时间测量数据.dat", "20150316214425-R-随机-PCALL-APD2-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150316214604", new String[]{"20150316214604-S-7_时间测量数据.dat", "20150316214604-S-7_随机数.dat", "20150316214604-R-随机-PCALL-APD2-7_时间测量数据.dat", "20150316214604-R-随机-PCALL-APD2-7_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150316214242", new String[]{"20150316214242-S-5_时间测量数据.dat", "20150316214242-S-5_随机数.dat", "20150316214242-R-随机-PCALL-APD2-5_时间测量数据.dat", "20150316214242-R-随机-PCALL-APD2-5_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150316215036", new String[]{"20150316215036-S-9_时间测量数据.dat", "20150316215036-S-9_随机数.dat", "20150316215036-R-随机-PCALL-APD1-9_时间测量数据.dat", "20150316215036-R-随机-PCALL-APD1-9_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150316215155", new String[]{"20150316215155-S-10_时间测量数据.dat", "20150316215155-S-10_随机数.dat", "20150316215155-R-随机-PCALL-APD1-10_时间测量数据.dat", "20150316215155-R-随机-PCALL-APD1-10_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//
//        FILENAME_MAP.put("20150317001706", new String[]{"20150317001706-测试_时间测量数据.dat", "20150317001706-测试_发射端随机数.dat", "20150317001706-实时测试_时间测量数据.dat", "20150317001706-实时测试_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150317004022", new String[]{"20150317004022-测试2_时间测量数据.dat", "20150317004022-测试2_发射端随机数.dat", "20150317004022-实时-PCALL-未加20km_时间测量数据.dat", "20150317004022-实时-PCALL-未加20km_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150317014713", new String[]{"20150317014713-S-实时-1_时间测量数据.dat", "20150317014713-S-实时-1_发射端随机数.dat", "20150317014713R-实时-PCALL-APD2-1_时间测量数据.dat", "20150317014713R-实时-PCALL-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150317015437", new String[]{"20150317015437-S-实时-2_时间测量数据.dat", "20150317015437-S-实时-2_发射端随机数.dat", "20150317015437R-实时-PCALL-APD2-2_时间测量数据.dat", "20150317015437R-实时-PCALL-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150317022929", new String[]{"20150317022929-S-实时-3_时间测量数据.dat", "20150317022929-S-实时-3_发射端随机数.dat", "20150317022929R-实时-PCALL-APD2-3_时间测量数据.dat", "20150317022929R-实时-PCALL-APD2-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150317024012", new String[]{"20150317024012-S-实时-4_时间测量数据.dat", "20150317024012-S-实时-4_发射端随机数.dat", "20150317024012R-实时-单路-APD2-4_时间测量数据.dat", "20150317024012R-实时-单路-APD2-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//
//         //2015-3-18
//        FILENAME_MAP.put("20150318220133", new String[]{"20150318220133-S-2_时间测量数据.dat", "20150318220133-S-2_随机数.dat", "20150318220145-R-单路-APD2-2_时间测量数据.dat", "20150318220145-R-单路-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318221407", new String[]{"20150318221407-S-3_时间测量数据.dat", "20150318221407-S-3_随机数.dat", "20150318221419-R-单路-APD2-3_时间测量数据.dat", "20150318221419-R-单路-APD2-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318224115", new String[]{"20150318224115-S-4_时间测量数据.dat", "20150318224115-S-4_随机数.dat", "20150318224128-R-PCALL-APD2-4_时间测量数据.dat", "20150318224128-R-PCALL-APD2-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318224504", new String[]{"20150318224504-S-6_时间测量数据.dat", "20150318224504-S-6_随机数.dat", "20150318224517-R-PCALL-APD2-6_时间测量数据.dat", "20150318224517-R-PCALL-APD2-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318230713", new String[]{"20150318230713-S-固定-8_时间测量数据.dat", "20150318230713-S-固定-8_随机数.dat", "20150318230713-R-单路-固定-APD2-8_时间测量数据.dat", "20150318230713-R-单路-固定-APD2-8_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318232240", new String[]{"20150318232240-S-固定-10_时间测量数据.dat", "20150318232240-S-固定-10_随机数.dat", "20150318232240-测试_时间测量数据.dat", "20150318232240-测试_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318233647", new String[]{"20150318233647-S-11_时间测量数据.dat", "20150318233647-S-11_随机数.dat", "20150318233647-R-单路-APD2-11_时间测量数据.dat", "20150318233647-R-单路-APD2-11_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318234621", new String[]{"20150318234621-S-12_时间测量数据.dat", "20150318234621-S-12_随机数.dat", "20150318234621-R-PCALL-APD2-12_时间测量数据.dat", "20150318234621-R-PCALL-APD2-12_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318235732", new String[]{"20150318235732-S-17_时间测量数据.dat", "20150318235732-S-17_随机数.dat", "20150318235732-R-单路-APD2-17_时间测量数据.dat", "20150318235732-R-单路-APD2-17_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150318234941", new String[]{"20150318234941-S-14_时间测量数据.dat", "20150318234941-S-14_随机数.dat", "20150318234941-R-PCALL-APD2-14_时间测量数据.dat", "20150318234941-R-PCALL-APD2-14_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319003041", new String[]{"20150319003041-S-19_时间测量数据.dat", "20150319003041-S-19_随机数.dat", "20150319003041-R-单路-APD2-19_时间测量数据.dat", "20150319003041-R-单路-APD2-19_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319003347", new String[]{"20150319003347-S-20_时间测量数据.dat", "20150319003347-S-20_随机数.dat", "20150319003347-R-单路-APD2-20_时间测量数据.dat", "20150319003347-R-单路-APD2-20_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319004847", new String[]{"20150319004847-S-22_时间测量数据.dat", "20150319004847-S-22_随机数.dat", "20150319004847-R-单路-APD2-22_时间测量数据.dat", "20150319004847-R-单路-APD2-22_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319011411", new String[]{"20150319011411-S-27_时间测量数据.dat", "20150319011411-S-27_随机数.dat", "20150319011411-R-PCALL-APD2-27_时间测量数据.dat", "20150319011411-R-PCALL-APD2-27_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319012117", new String[]{"20150319012117-S-28_时间测量数据.dat", "20150319012117-S-28_随机数.dat", "20150319012117-R-PCALL-APD2-28_时间测量数据.dat", "20150319012117-R-PCALL-APD2-28_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319012929", new String[]{"20150319012929-S-1_时间测量数据.dat", "20150319012929-S-1_随机数.dat", "20150319012929-R-PCALL-APD2-1_时间测量数据.dat", "20150319012929-R-PCALL-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319014519", new String[]{"20150319014519-S-6_时间测量数据.dat", "20150319014519-S-6_随机数.dat", "20150319014519-R-PCALL-APD2-6_时间测量数据.dat", "20150319014519-R-PCALL-APD2-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319015806", new String[]{"20150319015806-S-测试_时间测量数据.dat", "20150319015806-S-测试_随机数.dat", "20150319015806-R-测试_时间测量数据.dat", "20150319015806-R-测试_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319020721", new String[]{"20150319020721-S-测试-2_时间测量数据.dat", "20150319020721-S-测试-2_随机数.dat", "20150319020721-R-测试2_时间测量数据.dat", "20150319020721-R-测试2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150319021951", new String[]{"20150319021951-S-测试3_时间测量数据.dat", "20150319021951-S-测试3_随机数.dat", "20150319021951-R-测试3_时间测量数据.dat", "20150319021951-R-测试3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        
//        //2015-3-19
//        FILENAME_MAP.put("20150319233412", new String[]{"20150319233412-S-1_时间测量数据.dat", "20150319233412-S-1_随机数.dat", "20150319233412-R-单路-APD2-1_时间测量数据.dat", "20150319233412-R-单路-APD2-1_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150320000024", new String[]{"20150320000024-S-2_时间测量数据.dat", "20150320000024-S-2_随机数.dat", "20150320000024-R-单路-APD2-2_时间测量数据.dat", "20150320000024-R-单路-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150320001122", new String[]{"20150320001122-S-3_时间测量数据.dat", "20150320001122-S-3_随机数.dat", "20150320001122-R-单路-APD2-3_时间测量数据.dat", "20150320001122-R-单路-APD2-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150320004040", new String[]{"20150320004040-S-6_时间测量数据.dat", "20150320004040-S-6_随机数.dat", "20150320004039-R-PCALL-APD2-6_时间测量数据.dat", "20150320004039-R-PCALL-APD2-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150320005202", new String[]{"20150320005202-S-8_时间测量数据.dat", "20150320005202-S-8_随机数.dat", "20150320005202-R-PCALL-APD2-8_时间测量数据.dat", "20150320005202-R-PCALL-APD2-8_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150320020858", new String[]{"20150320020858-S-10_时间测量数据.dat", "20150320020858-S-10_随机数.dat", "20150320020858-R-PC2-APD2-10_时间测量数据.dat", "20150320020858-R-PC2-APD2-10_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150320022601", new String[]{"20150320022601-S-11_时间测量数据.dat", "20150320022601-S-11_随机数.dat", "20150320022601-R-PC25-APD2-11_时间测量数据.dat", "20150320022601-R-PC25-APD2-11_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150320024036", new String[]{"20150320024036-S-12_时间测量数据.dat", "20150320024036-S-12_随机数.dat", "20150320024036-R-PC5-APD2-12_时间测量数据.dat", "20150320024036-R-PC5-APD2-12_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        
        //2015-3-21
//        FILENAME_MAP.put("20150320233911", new String[]{"20150320233911-S-10_时间测量数据.dat", "20150320233911-S-10_随机数.dat", "20150320233911-R-单路-APD2-10_时间测量数据.dat", "20150320233911-R-单路-APD2-10_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321000106", new String[]{"20150321000106-S-11_时间测量数据.dat", "20150321000106-S-11_随机数.dat", "20150321000106-R-PC5-APD2-11_时间测量数据.dat", "20150321000106-R-PC5-APD2-11_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321002853", new String[]{"20150321002853-S-13_时间测量数据.dat", "20150321002853-S-13_随机数.dat", "20150321002853-R-PC5-APD2-13_时间测量数据.dat", "20150321002853-R-PC5-APD2-13_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321005834", new String[]{"20150321005834-S-14_时间测量数据.dat", "20150321005834-S-14_发射端随机数.dat", "20150321005834-R-PCALL-14_时间测量数据.dat", "20150321005834-R-PCALL-14_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321013747", new String[]{"20150321013747-s-2_时间测量数据.dat", "20150321013747-s-2_随机数.dat", "20150321013747-R-APD2-2_时间测量数据.dat", "20150321013747-R-APD2-2_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321014056", new String[]{"20150321014056-s-3_时间测量数据", "20150321014056-s-3_随机数.dat", "20150321014056-R-APD2-3_时间测量数据.dat", "20150321014056-R-APD2-3_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321014414", new String[]{"20150321014414-s-4_时间测量数据.dat", "20150321014414-s-4_随机数.dat", "20150321014414-R-APD2-4_时间测量数据.dat", "20150321014414-R-APD2-4_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321021725", new String[]{"20150321021725-s-13_时间测量数据.dat", "20150321021725-s-13_随机数.dat", "20150321021725-R-APD2-13_时间测量数据.dat", "20150321021725-R-APD2-13_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321023412", new String[]{"20150321023412-s-24_时间测量数据.dat", "20150321023412-s-24_随机数.dat", "20150321023412-R-APD2-24_时间测量数据.dat", "20150321023412-R-APD2-24_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321034826", new String[]{"20150321034826-s-测试-6_时间测量数据.dat", "20150321034826-s-测试-6_随机数.dat", "20150321034826-R-单路测试-6_时间测量数据.dat", "20150321034826-R-单路测试-6_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321040205", new String[]{"20150321040205-s-46_时间测量数据.dat", "20150321040205-s-46_随机数.dat", "20150321040205-R-APD2-46_时间测量数据.dat", "20150321040205-R-APD2-46_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321043737", new String[]{"20150321043737-s-065_时间测量数据.dat", "20150321043737-s-065_随机数.dat", "20150321043737-R-APD2-065_时间测量数据.dat", "20150321043737-R-APD2-065_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321050105", new String[]{"20150321050105-s-085_时间测量数据.dat", "20150321050105-s-085_发射端随机数.dat", "20150321050105-R-APD2-085_时间测量数据.dat", "20150321050105-R-APD2-085_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321050216", new String[]{"20150321050216-s-086_时间测量数据.dat", "20150321050216-s-086_随机数.dat", "20150321050216-R-APD2-086_时间测量数据.dat", "20150321050216-R-APD2-086_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321051251", new String[]{"20150321051251-s-095_时间测量数据.dat", "20150321051251-s-095_随机数.dat", "20150321051251-R-APD2-095_时间测量数据.dat", "20150321051251-R-APD2-095_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321051511", new String[]{"20150321051511-s-097_时间测量数据.dat", "20150321051511-s-097_随机数.dat", "20150321051511-R-APD2-097_时间测量数据.dat", "20150321051511-R-APD2-097_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321050326", new String[]{"20150321050326-s-087_时间测量数据.dat", "20150321050326-s-087_随机数.dat", "20150321050326-R-APD2-087_时间测量数据.dat", "20150321050326-R-APD2-087_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321080113", new String[]{"20150321080113-S-005_时间测量数据.dat", "20150321080113-S-005_随机数.dat", "20150321080113--010_时间测量数据.dat", "20150321080113--010_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321081211", new String[]{"20150321081211-s-098_时间测量数据.dat", "20150321081211-s-098_随机数.dat", "20150321081211-R-APD2-098_时间测量数据.dat", "20150321081211-R-APD2-098_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321082539", new String[]{"20150321082539-s-104_时间测量数据.dat", "20150321082539-s-104_随机数.dat", "20150321082539-R-APD2-104_时间测量数据.dat", "20150321082539-R-APD2-104_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321094831", new String[]{"20150321094831-s-129_时间测量数据.dat", "20150321094831-s-129_随机数.dat", "20150321094831-R-APD2-129_时间测量数据.dat", "20150321094831-R-APD2-129_接收端随机数.dat", "20150309213044-R-固定-单路-APD2-1_稳相结果.csv", "20150309213044-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321101355", new String[]{"20150321101355-s-139_时间测量数据.dat", "20150321101355-s-139_随机数.dat", "20150321101355-R-APD2-139_时间测量数据.dat", "20150321101355-R-APD2-139_接收端随机数.dat", "20150321101355-R-固定-单路-APD2-1_稳相结果.csv", "20150321101355-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321110404", new String[]{"20150321110404-s-164_时间测量数据.dat", "20150321110404-s-164_随机数.dat", "20150321110404-R-APD2-164_时间测量数据.dat", "20150321110404-R-APD2-164_接收端随机数.dat", "20150321110404-R-固定-单路-APD2-1_稳相结果.csv", "20150321110404-R-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321124507", new String[]{"20150321124507-s-199_时间测量数据.dat", "20150321124507-s-199_随机数.dat", "20150321124507-R-APD2-199_时间测量数据.dat", "20150321124507-R-APD2-199_接收端随机数.dat", "20150321124507-R-固定-单路-APD2-1_稳相结果.csv", "20150321124507-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321130504", new String[]{"20150321130504-s-201_时间测量数据.dat", "20150321130504-s-201_随机数.dat", "20150321130504-R-APD2-201_时间测量数据.dat", "20150321130504-R-APD2-201_接收端随机数.dat", "20150321130504-R-固定-单路-APD2-1_稳相结果.csv", "20150321130504-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321133823", new String[]{"20150321133823-s-211_时间测量数据.dat", "20150321133823-s-211_随机数.dat", "20150321133823-R-APD2-211_时间测量数据.dat", "20150321133823-R-APD2-211_接收端随机数.dat", "20150321133823-R-固定-单路-APD2-1_稳相结果.csv", "20150321133823-固定-单路-APD2-1_稳相数据.csv"});
//        FILENAME_MAP.put("20150321150519", new String[]{"20150321150519-s-250_时间测量数据.dat", "20150321150519-s-250_随机数.dat", "20150321150519-R-APD2-250_时间测量数据.dat", "20150321150519-R-APD2-250_接收端随机数.dat", "20150321150519-R-固定-单路-APD2-1_稳相结果.csv", "20150321150519-固定-单路-APD2-1_稳相数据.csv"});
    }
    private final String id;
    private String index;
    private final File path;
    private TimeEventList aliceRandomList;
    private TimeEventList bobRandomList;
    private TimeEventList apd1List;
    private TimeEventList apd2List;
    private TimeEventList apdList;
    private byte mask = (byte) 0xff;
    private ArrayList<DecodingRandom> BobQRNGList;
    private File FineTimeCalibrateFile = new File("G:\\DPS数据处理\\DPS实验数据\\FineTimeCalibrateFile-13.txt");

    public Experiment(String id, File path) {
        this.id = id;
        this.path = path;
    }

    public Experiment(String id, String index, File path) {
        this.id = id;
        this.index = index;
        this.path = path;
    }

    public void loadData() throws IOException, DeviceException {
        String[] fileNames = FILENAME_MAP.get(id);
        if (fileNames == null) {
            //          new String[]{"20150321151723-s-251_时间测量数据.dat", "20150321151723-s-251_随机数.dat", "20150321151723-R-APD2-251_时间测量数据.dat", "20150321151723-R-APD2-251_接收端随机数.dat", "20150321150519-R-固定-单路-APD2-1_稳相结果.csv", "20150321150519-固定-单路-APD2-1_稳相数据.csv"});

            //fileNames = new String[]{id + "-s-" + index + "_时间测量数据.dat", id + "-s-" + index + "_发射端随机数.dat", id + "-R-APD2-" + index + "_时间测量数据.dat", id + "-R-APD2-" + index + "_接收端随机数.dat", id + "-R-固定-单路-APD2-1_稳相结果.csv", id + "-固定-单路-APD2-1_稳相数据.csv"};
            //cc固定编码
             fileNames = new String[]{id + "-S-" + index + "_时间测量数据.dat",  "20150318230713-S-固定-8_随机数.dat", id + "-R-" + index + "_时间测量数据.dat", id + "-R-" + index + "_接收端随机数.dat", "20150417230033-R-APD2-077_稳相结果.csv",  "20150417230033-R-APD2-077_稳相数据.csv"};
            //00编码
//             fileNames = new String[]{id + "-s-" + index + "_时间测量数据.dat",  "rnd-00.dat", id + "-R-APD2-" + index + "_时间测量数据.dat", id + "-R-APD2-" + index + "_接收端随机数.dat", id + "-R-固定-单路-APD2-1_稳相结果.csv", id + "-固定-单路-APD2-1_稳相数据.csv"};
            
            System.out.println(Arrays.toString(fileNames));
        }
//        System.out.println(Arrays.toString(fileNames));
        File AliceTDCFile = new File(path, fileNames[0]);
        File AliceQRNGFile = new File(path, fileNames[1]);
        File BobTDCFile = new File(path, fileNames[2]);
        File BobQRNGFile = new File(path, fileNames[3]);
        File plrFile = new File(path, fileNames[4]);
        File pldFile = new File(path, fileNames[5]);
        TimeEventSegment aliceSegment = loadTDCFile(AliceTDCFile);
        System.out.println("Load alice TDC");
        TimeEventSegment bobSegment = loadTDCFile(BobTDCFile);
        System.out.println("Load bob TDC");

        ArrayList<EncodingRandom> aliceQRNGList = loadEncodingQRNGFile(AliceQRNGFile);
        System.out.println("Load alice QRNG");
        ArrayList<DecodingRandom> bobQRNGList = loadDecodingQRNGFile(BobQRNGFile, getMask());
        System.out.println("Load bob QRNG");
        setBobQRNGList(bobQRNGList);
        System.out.println("Set bob QRNG");
//        ArrayList<PhaseLockingResult> phaseLockingResultlist = loadPhaseLockerFile(plrFile, pldFile);
        aliceRandomList = timingQRNG(aliceQRNGList, aliceSegment.getEventList(1));
        System.out.println("Timing alice QRNG");
        setBobRandomList(timingQRNG(bobQRNGList, bobSegment.getEventList(1)));
        System.out.println("Timing bob QRNG");
        System.out.println(aliceQRNGList.size() + "\t" + getBobRandomList().size());
        apd1List = bobSegment.getEventList(CHANNEL_APD1);
        apd2List = bobSegment.getEventList(CHANNEL_APD2);
//        System.out.println(apd1List.size()+"\t"+apd2List.size());
    }

    public void sync(long delay1, long delay2) {
//        TimeEventList aliceGPSList = aliceSegment.getEventList(0);
//        TimeEventList aliceSyncList = aliceSegment.getEventList(1);
//        TimeEventList bobGPSList = bobSegment.getEventList(0);
//        TimeEventList bobSyncList = bobSegment.getEventList(1);
//        long coarseDelay = aliceGPSList.get(0).getTime() - bobGPSList.get(0).getTime();
//        RecursionCoincidenceMatcher syncMatcher = new RecursionCoincidenceMatcher(bobSyncList, aliceSyncList, 1000000, coarseDelay);

        for (int i = 0; i < apd1List.size(); i++) {
            TimeEvent e = apd1List.get(i);
            apd1List.set(new TimeEvent(e.getTime() - delay1, e.getChannel()), i);
        }
        for (int i = 0; i < apd2List.size(); i++) {
            TimeEvent e = apd2List.get(i);
            apd2List.set(new TimeEvent(e.getTime() - delay2, e.getChannel()), i);
        }
    }

    public void filterAndMerge(long before, long after) {
        System.out.println("apd1List size befor filte: "+ apd1List.size());
        System.out.println("apd2List size befor filte: "+apd2List.size());
        apd1List = doFilter(apd1List, getBobRandomList(), before, after);
        apd2List = doFilter(apd2List, getBobRandomList(), before, after);
        System.out.println("apd1List size after filte: "+apd1List.size());
        System.out.println("apd2List size after filte: "+apd2List.size());
        apdList = new MergedTimeEventList(apd1List, apd2List);
        System.out.println("-" + apdList.size());
    }

    public ArrayList<Decoder.Entry> decoding(long gate) {
        Tagger tagger = new Tagger(getBobRandomList(), apdList, gate);
        ArrayList<Tagger.Entry> tags = tagger.tag();

        Decoder decoder = new Decoder(tags, aliceRandomList, getBobRandomList());
        ArrayList<Decoder.Entry> result = decoder.decode();
        return result;
    }

    private TimeEventList doFilter(TimeEventList apdList, TimeEventList bobRandomList, long before, long after) {
        Iterator<TimeEvent> apdIterator = apdList.iterator();
        Iterator<TimeEvent> syncIterator = bobRandomList.iterator();
        TimeEvent syncEvent = syncIterator.next();
        long startTime = syncEvent.getTime() - before;
        long endTime = syncEvent.getTime() + after;
        TimeEvent apdEvent = apdIterator.next();
        StreamTimeEventList newList = new StreamTimeEventList();
        while (true) {
            long time = apdEvent.getTime();
            if (time <= endTime) {
                if (time >= startTime) {
                    newList.offer(apdEvent);
                }
                if (apdIterator.hasNext()) {
                    apdEvent = apdIterator.next();
                } else {
                    apdEvent = null;
                }
            } else {
                if (syncIterator.hasNext()) {
                    syncEvent = syncIterator.next();
                    startTime = syncEvent.getTime() - before;
                    endTime = syncEvent.getTime() + after;
                } else {
                    syncEvent = null;
                }
            }
            if (apdEvent == null || syncEvent == null) {
                break;
            }
        }
        return newList;
    }

    private TimeEventSegment loadTDCFile(File file) throws IOException, DeviceException {
       // TimeEventLoader loader = new PXI40PS1Loader(file, FineTimeCalibrateFile);
        TimeEventLoader loader = new PXI40PS1Loader(file,null);
        return TimeEventDataManager.loadTimeEventSegment(loader);
    }

    private ArrayList<EncodingRandom> loadEncodingQRNGFile(File file) throws IOException, DeviceException {
        InputStream input = new BufferedInputStream(new FileInputStream(file), 2000000);
        byte[] b = new byte[16];
        int index = 0;
        ArrayList<EncodingRandom> list = new ArrayList<>();
        int sum = 0;
        while (true) {
            int[] randomList = new int[128];
            int read = input.read(b);
            if (read < 16) {
                break;
            }
            sum += read;//System.out.println(sum);
            for (int i = 0; i < 128; i++) {
                if (((b[(i / 8)] >>> (7 - (i % 8))) & 0x01) == 0x01) {
                    randomList[i] = 0;
                } else {
                    randomList[i] = 1;
                }
            }
        EncodingRandom encodingRandom = new EncodingRandom(randomList);
            list.add(encodingRandom);
            index++;
           // System.out.println(Arrays.toString(randomList));
        }   
        
        //New!!
//         InputStream input = new BufferedInputStream(new FileInputStream(file), 2000000);
//        byte[] b = new byte[16];
//        int index = 0;
//        ArrayList<EncodingRandom> list = new ArrayList<>();
//        int sum = 0;
//        boolean hasnext=true;
//        while (hasnext) {
//            int[] randomList = new int[128];
//            for (int i = 0; i < 128; i++) {
//                int read = input.read();
//                if(read==-1){
//                    hasnext=false;
//                    break;
//                }else {
//                    randomList[i]=read;
//                }
//               System.out.println(read);
//            }
//            
//            EncodingRandom encodingRandom = new EncodingRandom(randomList);
//            list.add(encodingRandom);
//            index++;
//        }
        return list;
    }

    private ArrayList<DecodingRandom> loadDecodingQRNGFile(File file, byte mask) throws IOException, DeviceException {
        FileInputStream input = new FileInputStream(file);
        int b;
//        b = input.read();//加20km光纤，延时100us,丢一个随机数。
        ArrayList<DecodingRandom> list = new ArrayList<>();
        while (true) {
            b = input.read();
            if (b == -1) {
                break;
            }
//            int[] RrandomList = new int[7];
            int [] RrandomList = new int[8]; //加入1比特APD稳相选择位
            int[] delaypulse = new int[2];
            int APDFlag ;                 //APD稳相Flag
            byte R = (byte) b;
            for (int i = 0; i < 8; i++) {
                if ((((R & mask) >>> i) & 0x01) == 0x01) {
                    RrandomList[i] = 1;
                } else {
                    RrandomList[i] = 0;
                }
            }
            delaypulse[0] =(RrandomList[0] + RrandomList[1] * 2 + RrandomList[2] * 4 + RrandomList[3] * 8);
            delaypulse[1] = RrandomList[4] * 16 + RrandomList[5] * 32 + RrandomList[6] * 64;
            APDFlag=RrandomList[7];
            //System.out.println( delaypulse[0]+"\t"+ delaypulse[1]);
            list.add(new DecodingRandom(delaypulse[0], delaypulse[1],APDFlag));
        }
        return list;
    }

    private <T> TimeEventList timingQRNG(ArrayList<T> QRNGList, TimeEventList timingList) {
        //数据校验
        if (DEBUG) {
            Iterator<TimeEvent> iterator = timingList.iterator();
            TimeEvent t1 = iterator.next();
            while (iterator.hasNext()) {
                TimeEvent t2 = iterator.next();
                long deltaT = t2.getTime() - t1.getTime();
                if (Math.abs(deltaT) > 150000000 && Math.abs(deltaT) < 700000000000l) {
                    throw new RuntimeException();
                }
                t1 = t2;
            }
        }

        int length = Math.min(QRNGList.size(), timingList.size());
        StreamTimeEventList streamTimeEventList = new StreamTimeEventList();
        Iterator<TimeEvent> iterator = timingList.iterator();
        for (int i = 0; i < length; i++) {
            T random = QRNGList.get(i);
            TimeEvent timeEvent;
            if (iterator.hasNext()) {
                timeEvent = iterator.next();
            } else {
                throw new RuntimeException();
            }
            ExtandedTimeEvent<T> ete = new ExtandedTimeEvent<>(timeEvent.getTime(), timeEvent.getChannel(), random);
            //System.out.println(timeEvent.getTime()+"\t"+ete.getTime());
            streamTimeEventList.offer(ete);
        }
        return streamTimeEventList;
    }

    public ArrayList<PhaseLockingResult> loadPhaseLockerFile(File plrFile, File pldFile) throws FileNotFoundException, IOException {
//        File path = new File("G:\\DPS数据处理\\DPS实验数据\\2015-2-11\\一次一稳");
//        File plrFile = new File(path, "20150212024655-PC-APD1-6_稳相结果.csv");
//        File pldFile = new File(path, "20150212024655-PC-APD1-6_稳相数据.csv");
        ArrayList<PhaseLockingResult> phaseLockingResultlist = new ArrayList<>();;
        BufferedReader plrReader = new BufferedReader(new InputStreamReader(new FileInputStream(plrFile), "GB2312"));
        BufferedReader pldReader = new BufferedReader(new InputStreamReader(new FileInputStream(pldFile), "GB2312"));
        while (true) {
            String[] plrs = readLines(plrReader, 3);
            String[] plds = readLines(pldReader, 24);
            if (plrs == null || plds == null) {
                break;
            }
            PhaseLockingResult phaseLockingResult = parse(plrs, plds);
            phaseLockingResultlist.add(phaseLockingResult);
        }
        return phaseLockingResultlist;
    }

    private String[] readLines(BufferedReader reader, int count) throws IOException {
        String[] results = new String[count];
        for (int i = 0; i < count; i++) {
            String line = reader.readLine();
            if (line == null) {
                return null;
            }
            results[i] = line;
        }
        return results;
    }

    private PhaseLockingResult parse(String[] plrs, String[] plds) {
        String[] split1 = plrs[2].split(" *, *");
        int plResult = Integer.parseInt(split1[6]);

        int countAPD1 = 0;
        int countAPD2 = 0;
        for (String pld : plds) {
            String[] split2 = pld.split(" *, *");
            countAPD1 += Integer.parseInt(split2[3]);
            countAPD2 += Integer.parseInt(split2[4]);
        }
        double plLarge = (countAPD1 + countAPD2) / 24.;
//        System.out.println(plLarge / plResult);
        return new PhaseLockingResult(plResult, plLarge);
    }

    void test() {
        MergedTimeEventList m = new MergedTimeEventList(apd1List, apd2List);
        System.out.println(m.size());
        Iterator<TimeEvent> iterator = m.iterator();
        long t = 0;
        int i = 0;
        while (iterator.hasNext()) {
            TimeEvent next = iterator.next();
            if (next.getTime() < t) {
                System.out.println("wrong");
            } else {
                t = next.getTime();
            }
        }
    }

    /**
     * @return the mask
     */
    public byte getMask() {
        return mask;
    }

    /**
     * @param mask the mask to set
     */
    public void setMask(byte mask) {
        this.mask = mask;
    }

    /**
     * @return the bobRandomList
     */
    public TimeEventList getBobRandomList() {
        return bobRandomList;
    }

    /**
     * @param bobRandomList the bobRandomList to set
     */
    public void setBobRandomList(TimeEventList bobRandomList) {
        this.bobRandomList = bobRandomList;
    }

    /**
     * @return the BobQRNGList
     */
    public ArrayList<DecodingRandom> getBobQRNGList() {
        return BobQRNGList;
    }

    /**
     * @param BobQRNGList the BobQRNGList to set
     */
    public void setBobQRNGList(ArrayList<DecodingRandom> BobQRNGList) {
        this.BobQRNGList = BobQRNGList;
    }
}
